const data2 = {
    favorite: {
        fermata: {
            moonriver: {
                name: 'Moon River',
                url: '../midi/moonriver.midi',
                textShort: 'Жизнь - это долгий путь домой, в котором сон земной летит.',
                lengthShort: 16,
                text: '1. Жизнь это долгий путь домой, / в котором сон земной летит. / И мы вместе летим с песней, / она как молитва, она есть любовь. / В ней льются тайные мечты, / в ней Бог дарит тепло нам в жизнь. / И в нас всех летит песнь, / она - долгий путь домой, / и этот сон земной - / Любовь, Бог и я.' + '<br>' +
                    '2. Жизнь это горная река, / свой путь она хранит в веках. / И мы вместе плывём с песней, / она как молитва, исток родника. / Наш парус носит свой секрет, / который нас хранит от бед. / И в нас всех летит песнь, / она - долгий путь домой, / и этот сон земной - / Любовь, Бог и я.'
            }
        },
        pstgu: {
            kenguru: {
                name: 'Кенгуру',
                url: '../midi/kenguru.midi',
                textShort: 'Сон меня сегодня не разнежил, я проснулась рано по утру.',
                lengthShort: 20,
                text: 'Сон меня сегодня не разнежил, / я проснулась рано по утру / и пошла, вдыхая воздух свежий, / посмотреть живого кенгуру. / Он срывал пучки смолистых игол, / глупый, для чего-то их жевал, / и смешно, смешно ко мне запрыгал, / и еще смешнее закричал. / У него так неуклюжи ласки, / но и я люблю ласкать его, /  чтоб его коричневые глазки / мигом осветило торжество. / А потом, охвачена истомой, / я мечтать уселась на скамью: / что ж нейдет он, дальний, незнакомый, тот один, которого люблю! / Мысли так отчетливо ложатся, / словно тени листьев по утру, / я хочу к кому-нибудь ласкаться, / как ко мне ласкался кенгуру.'
            }
        }
    },
    glases: {
        tropar: {
            name: 'Тропари',
            glas1: {
                name: 'Глас 1',
                url: '../midi/tropar-glas1.midi',
                urlShort: '../midi/tropar-glas1-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Ка́мени запеча́тану от иуде́й / и во́ином стрегу́щим Пречи́стое Те́ло Твое́, / воскре́сл еси́ тридне́вный, Спа́се, / да́руяй ми́рови жи́знь. / Сего́ ра́ди си́лы небе́сныя вопия́ху Ти́, Жизнода́вче: / сла́ва воскресе́нию Твоему́, Христе́, / сла́ва Ца́рствию Твоему́, / сла́ва смотре́нию Твоему́, еди́не Человеколю́бче.'
            },
            glas2: {
                name: 'Глас 2',
                url: '../midi/tropar-glas2.midi',
                urlShort: '../midi/tropar-glas2-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Егда́ снизше́л еси́ к сме́рти, Животе́ Безсме́ртный, / тогда́ а́д умертви́л еси́ блиста́нием Божества́: / егда́ же и уме́ршия от преиспо́дних воскреси́л еси́, / вся́ си́лы небе́сныя взыва́ху: / Жизнода́вче, Христе́ Бо́же на́ш, сла́ва Тебе́.'
            },
            glas3: {
                name: 'Глас 3',
                url: '../midi/tropar-glas3.midi',
                urlShort: '../midi/tropar-glas3-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Да веселя́тся небе́сная, / да ра́дуются земна́я, / я́ко сотвори́ держа́ву / мы́шцею Свое́ю Госпо́дь, / попра́ сме́ртию сме́рть, / пе́рвенец ме́ртвых бы́сть; / из чре́ва а́дова изба́ви на́с, / и подаде́ ми́рови ве́лию ми́лость.'
            },
            glas4: {
                name: 'Глас 4',
                url: '../midi/tropar-glas4.midi',
                urlShort: '../midi/tropar-glas4-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Све́тлую воскресе́ния про́поведь / от А́нгела уве́девша Госпо́дни учени́цы / и пра́деднее осужде́ние отве́ргша, / апо́столом хва́лящася глаго́лаху: / испрове́ржеся сме́рть, / воскре́се Христо́с Бо́г, / да́руяй ми́рови ве́лию ми́лость.'
            },
            glas5: {
                name: 'Глас 5',
                url: '../midi/tropar-glas5.midi',
                urlShort: '../midi/tropar-glas5-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Собезнача́льное Сло́во Отцу́ и Ду́хови, / от Де́вы ро́ждшееся на спасе́ние на́ше, / воспои́м, ве́рнии, и поклони́мся, / я́ко благоволи́ пло́тию взы́ти на кре́ст, / и сме́рть претерпе́ти, / и воскреси́ти уме́ршия / сла́вным воскресе́нием Свои́м.'
            },
            glas6: {
                name: 'Глас 6',
                url: '../midi/tropar-glas6.midi',
                urlShort: '../midi/tropar-glas6-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'А́нгельския си́лы на гро́бе Твое́м, / и стрегу́щии омертве́ша, / и стоя́ше Мари́я во гро́бе, / и́щущи Пречи́стаго Те́ла Твоего́. / Плени́л еси́ а́д, не искуси́вся от него́; / сре́тил еси́ Де́ву, да́руяй живо́т. / Воскресы́й из ме́ртвых. Го́споди, сла́ва Тебе́.'
            },
            glas7: {
                name: 'Глас 7',
                url: '../midi/tropar-glas7.midi',
                urlShort: '../midi/tropar-glas7-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Разруши́л еси́ Кресто́м Твои́м сме́рть, / отве́рзл еси́ разбо́йнику ра́й, / мироно́сицам пла́ч преложи́л еси́, / и апо́столом пропове́дати повеле́л еси́, / я́ко воскре́сл еси́, Христе́ Бо́же, / да́руяй ми́рови / ве́лию ми́лость.'
            },
            glas8: {
                name: 'Глас 8',
                url: '../midi/tropar-glas8.midi',
                urlShort: '../midi/tropar-glas8-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'С высоты́ снизше́л еси́, Благоутро́бне, / погребе́ние прия́л еси́ тридне́вное, / да на́с свободи́ши страсте́й, / Животе́ и воскресе́ние на́ше. Го́споди, сла́ва Тебе́.'
            }
        },
        kondak: {
            name: 'Кондаки',
            glas1: {
                name: 'Глас 1',
                url: '../midi/kondak-glas1.midi',
                urlShort: '../midi/tropar-glas1-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Воскре́сл еси́ я́ко Бо́г из гро́ба во сла́ве, / и ми́р совоскреси́л еси́; / и естество́ челове́ческое я́ко Бо́га воспева́ет Тя́, и сме́рть исчезе́; / Ада́м же лику́ет, Влады́ко; / Е́ва ны́не от у́з избавля́ема ра́дуется, зову́щи: / Ты́ еси́, И́же все́м подая́, Христе́, воскресе́ние.'
            },
            glas2: {
                name: 'Глас 2',
                url: '../midi/kondak-glas2.midi',
                urlShort: '../midi/tropar-glas2-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Воскре́сл еси́ от гро́ба, Всеси́льне Спа́се, / и а́д ви́дев чу́до, ужасе́ся, / и ме́ртвии воста́ша; / тва́рь же ви́дящи сра́дуется Тебе́, / и Ада́м свесели́тся, / и ми́р, Спа́се мо́й, воспева́ет Тя́ при́сно.'
            },
            glas3: {
                name: 'Глас 3',
                url: '../midi/kondak-glas3.midi',
                urlShort: '../midi/tropar-glas3-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Воскре́сл еси́ дне́сь из гро́ба, Ще́дре, / и на́с возве́л еси́ от вра́т сме́ртных; / дне́сь Ада́м лику́ет, и ра́дуется Е́ва, / вку́пе же и проро́цы с патриа́рхи воспева́ют непреста́нно / Боже́ственную держа́ву вла́сти Твоея́.'
            },
            glas4: {
                name: 'Глас 4',
                url: '../midi/kondak-glas4.midi',
                urlShort: '../midi/tropar-glas4-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Спа́с и Изба́витель мо́й / из гро́ба, я́ко Бо́г, / воскреси́ от у́з земноро́дныя, / и врата́ а́дова сокруши́, / и я́ко Влады́ка воскре́се тридне́вен.'
            },
            glas5: {
                name: 'Глас 5',
                url: '../midi/kondak-glas5.midi',
                urlShort: '../midi/tropar-glas5-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Ко а́ду, Спа́се мо́й, соше́л еси́, / и врата́ сокруши́вый я́ко Всеси́лен, / уме́рших я́ко Созда́тель совоскреси́л еси́, / и сме́рти жа́ло сокруши́л еси́, / и Ада́м от кля́твы изба́влен бы́сть, Человеколю́бче, / спаси́ на́с, Го́споди.'
            },
            glas6: {
                name: 'Глас 6',
                url: '../midi/kondak-glas6.midi',
                urlShort: '../midi/tropar-glas6-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Живонача́льною дла́нию / уме́ршия от мра́чных удо́лий, / Жизнода́вец, воскреси́в все́х Христо́с Бо́г, / воскресе́ние подаде́ челове́ческому ро́ду: / е́сть бо все́х Спаси́тель, / воскресе́ние и живо́т, / и Бо́г все́х.'
            },
            glas7: {
                name: 'Глас 7',
                url: '../midi/kondak-glas7.midi',
                urlShort: '../midi/tropar-glas7-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Не ктому́ держа́ва сме́ртная возмо́жет держа́ти челове́ки: / Христо́с бо сни́де, сокруша́я и разоря́я си́лы ея́; / связу́емь быва́ет а́д, / проро́цы согла́сно ра́дуются, / предста́, глаго́люще, Спа́с су́щим в ве́ре: / изыди́те, ве́рнии, в воскресе́ние.'
            },
            glas8: {
                name: 'Глас 8',
                url: '../midi/kondak-glas8.midi',
                urlShort: '../midi/tropar-glas8-short.midi',
                textShort: 'Бог Господь и явися нам, благословен Грядый во Имя Господне.',
                text: 'Воскре́с из гро́ба, уме́ршия воздви́гл еси́, / и Ада́ма воскреси́л еси́, / и Е́ва лику́ет во Твое́м воскресе́нии, / и мирсти́и концы́ торжеству́ют / е́же из ме́ртвых воста́нием Твои́м, Многоми́лостиве.'
            }
        },
        stihira: {
            name: 'Стихиры',
            glas1: {
                name: 'Глас 1',
                url: '../midi/stihira-glas1.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 20,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas2: {
                name: 'Глас 2',
                url: '../midi/stihira-glas2.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 18,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas3: {
                name: 'Глас 3',
                url: '../midi/stihira-glas3.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 18,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas4: {
                name: 'Глас 4',
                url: '../midi/stihira-glas4.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 18,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas5: {
                name: 'Глас 5',
                url: '../midi/stihira-glas5.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 18,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas6: {
                name: 'Глас 6',
                url: '../midi/stihira-glas6.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 18,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas7: {
                name: 'Глас 7',
                url: '../midi/stihira-glas7.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 18,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            },
            glas8: {
                name: 'Глас 8',
                url: '../midi/stihira-glas8.midi',
                textShort: 'Господи, воззвах к Тебе, услыши мя. Услыши мя, Господи.',
                lengthShort: 19,
                text: 'Го́споди, воззва́х к Тебе́, услы́ши мя. / Услы́ши мя, Го́споди! / Го́споди, воззва́х к Тебе́, услы́ши мя, / вонми́ гла́су моле́ния моего́, / внегда́ воззва́ти ми к Тебе́. / Услы́ши мя, Го́споди!'
            }
        },
        irmos: {
            name: 'Ирмосы',
            glas1: {
                name: 'Глас 1',
                url: '../midi/irmos-glas1.midi',
                textShort: 'Твоя победительная десница боголепно в крепости прославится.',
                lengthShort: 23,
                text: 'Твоя́ победи́тельная десни́ца / боголе́пно в кре́пости просла́вится: / та бо безсме́ртне, / я́ко всемогу́щая, проти́вныя сотре́, / израильтя́ном путь глубины́ новосоде́лавшая.'
            },
            glas2: {
                name: 'Глас 2',
                url: '../midi/irmos-glas2.midi',
                textShort: 'Во глубине постла иногда, фараонитское всевоинство преоруженная сила.',
                lengthShort: 31,
                text: 'Во глубине́ постла́ иногда́, / фараони́тское всево́инство преоруже́нная си́ла, / вопло́щшееся же Сло́во всезло́бный гре́х потреби́ло е́сть, / Препросла́вленный Госпо́дь, / сла́вно бо просла́вися.'
            },
            glas3: {
                name: 'Глас 3',
                url: '../midi/irmos-glas3.midi',
                textShort: 'Воды древле, манием Божественным, во едино сонмище совокупивый.',
                lengthShort: 27,
                text: 'Во́ды дре́вле, ма́нием Боже́ственным, / во еди́но со́нмище совокупи́вый, / и раздели́вый мо́ре изра́ильтеским лю́дем, / Се́й Бо́г на́ш, препросла́влен е́сть: / Тому́ Еди́ному пои́м, я́ко просла́вися.'
            },
            glas4: {
                name: 'Глас 4',
                url: '../midi/irmos-glas4.midi',
                textShort: 'Моря чермную пучину невлажными стопами.',
                lengthShort: 16,
                text: 'Мо́ря чермну́ю пучи́ну / невла́жными стопа́ми, / дре́вний пешеше́ствовав Изра́иль, / крестообра́зныма Моисе́овыма рука́ма / Aмали́кову си́лу в пусты́ни победи́л е́сть.'
            },
            glas5: {
                name: 'Глас 5',
                url: '../midi/irmos-glas5.midi',
                textShort: 'Коня и всадника в море Чермное, сокрушаяй брани мышцею высокою.',
                lengthShort: 29,
                text: 'Коня́ и вса́дника в мо́ре Чермно́е, / сокруша́яй бра́ни мы́шцею высо́кою, / Христо́с истрясе́: Изра́иля же спасе́, / побе́дную пе́снь пою́ща.'
            },
            glas6: {
                name: 'Глас 6',
                url: '../midi/irmos-glas6.midi',
                textShort: 'Яко по суху пешешествовав Израиль, по бездне стопами.',
                lengthShort: 20,
                text: 'Я́ко по су́ху пешеше́ствовав Изра́иль, / по бе́здне стопа́ми, / гони́теля фарао́на / ви́дя потопля́ема, / Бо́гу / побе́дную пе́снь пои́м, вопия́ше.'
            },
            glas7: {
                name: 'Глас 7',
                url: '../midi/irmos-glas7.midi',
                textShort: 'Манием Твоим на земный образ преложися, прежде удоборазливаемое водное естество, Господи.',
                lengthShort: 34,
                text: 'Ма́нием Твои́м на земны́й о́браз преложи́ся, / пре́жде удоборазлива́емое водно́е естество́, Го́споди: / те́мже немо́кренно пешеше́ствовав Изра́иль, / пое́т Тебе́ пе́снь побе́дную.'
            },
            glas8: {
                name: 'Глас 8',
                url: '../midi/irmos-glas8.midi',
                textShort: 'Колесницегонителя фараоня погрузи, чудотворяй иногда.',
                lengthShort: 23,
                text: 'Колесницегони́теля фарао́ня погрузи́, / чудотворя́й иногда́ / Моисе́йский же́зл, крестообра́зно порази́в, / и раздели́в мо́ре: / Изра́иля же беглеца́, пешехо́дца спасе́, / пе́снь Бо́гови воспева́юща.'
            }
        },
    },
    liturg: {
        heruvim: {
            name: 'Херувимская',
            obihod7: {
                name: 'Обиходная №7',
                url: '../midi/heruvim-obihod7.midi',
                textShort: 'Иже Херувимы, иже Херувимы.',
                lengthShort: 11,
                text: 'И́же Херуви́мы, и́же Херуви́мы, та́йно, та́йно образу́юще, образу́юще и животворя́щей, и животворя́щей Тро́ице трисвяту́ю пе́снь припева́юще, припева́юще, вся́кое ны́не, ны́не жите́йское отложи́м, отложи́м попече́ние. Ами́нь. Я́ко да Царя́ всех поды́мем, А́нгельскими неви́димо, неви́димо дориноси́ма чи́нми. Аллилу́иа, аллилу́иа, аллилу́иа.',
            }
        }
    }
},
    key = 'ztd';
var key1 = 'pstgu' + key,
    key2 = 'fermata' + key;