const data2 = {
    liturg: {
        heruvim: {
            name: 'Херувимская',
            obihod7: {
                name: 'Обиходная №7',
                url: '../midi/heruvim_obihod7.midi',
                textShort: 'Иже Херувимы, иже Херувимы.',
                lengthShort: 11,
                text: 'И́же Херуви́мы, и́же Херуви́мы, та́йно, та́йно образу́юще, образу́юще и животворя́щей, и животворя́щей Тро́ице трисвяту́ю пе́снь припева́юще, припева́юще, вся́кое ны́не, ны́не жите́йское отложи́м, отложи́м попече́ние. Ами́нь. Я́ко да Царя́ всех поды́мем, А́нгельскими неви́димо, неви́димо дориноси́ма чи́нми. Аллилу́иа, аллилу́иа, аллилу́иа.',
            }
        }
    }
}